/* Non-user-facing error text for a connection that has been closed due to a timeout. */
"GCDAsyncSocketClosedError" = "Soquete fechado por ponto remoto";

/* Non-user-facing error text for an attempted connection that has failed due to a timeout. */
"GCDAsyncSocketConnectTimeoutError" = "Tentativa de conexão com o servidor expirou";

/* No comment provided by engineer. */
"GCDAsyncSocketOtherError" = "A tentativa de criar soquete do soquete FD falhou. getpeername () falhou";

/* Non-user-facing error text for a read operation that has read the maximum amount of allowed data. */
"GCDAsyncSocketReadMaxedOutError" = "Operação de leitura atingiu o comprimento máximo definido";

/* Non-user-facing error text for a read operation that has failed due to a timeout. */
"GCDAsyncSocketReadTimeoutError" = "A operação de leitura expirou";

/* Non-user-facing error text for a write operation that has failed due to a timeout. */
"GCDAsyncSocketWriteTimeoutError" = "A operação escrita expirou";

